app/controllers/frame1_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."parent_id" IS NULL ORDER BY "categories"."name" ASC
---



            categories = Category.where(parent_id: nil).order(:name)

INSERT INTO "categories" ("name", "parent_id") VALUES (?, ?)  [["name", "Категория1уровня"], ["parent_id", 1]]
---
            categories.each_with_index do |category, index|
                case index % 3
                when 0
                    @column1.push(category)

SELECT "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Категория1уровня11"], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE (parent_id= )
SELECT "categories".* FROM "categories" WHERE "categories"."parent_id" IS NULL AND "categories"."name" != ?  [["name", "Категория1уровня28"]]
---
        def show2
            active_category1 = Category.find_by(name:params[:subcategory1])
            @active_category1_name = active_category1.name
            @categories_L2 = Category.where(parent_id:active_category1.id)

            @current_param = params[:subcategory1].to_s

            cur1 = Category.where(parent_id:nil)
            @rest_categories_level1 = cur1.where.not(name:params[:subcategory1])

SELECT "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Категория1уровня12"], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Категория2уровня12"], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."parent_id" = ?  [["parent_id", 270]]
SELECT "categories".* FROM "categories" WHERE "categories"."parent_id" = ? AND "categories"."name" != ?  [["parent_id", nil], ["name", "Категория1уровня12"]]
SELECT "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "2К2атегория2уровня15"], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."parent_id" = ? AND "categories"."name" != ?  [["parent_id", nil], ["name", "Категория1уровня1"]]
---
        def show3
            current_category_L1 = Category.find_by(name:params[:subcategory1])
            @current_category_L1 = current_category_L1.name

            current_category_L2 = Category.find_by(name:params[:subcategory2])
            @current_category_L2 = current_category_L2.name

            current_category_parent_id_l2 = current_category_L2.id
            @categories_L3 = Category.where(parent_id: current_category_parent_id_l2)

            cur1 = Category.where(parent_id:nil)
            @rest_categories_level1 = cur1.where.not(name:params[:subcategory1])

            cur_el_lev2 = Category.find_by(name:params[:subcategory2])
            cur2 = Category.where(parent_id:cur_el_lev2.parent_id)
            @rest_categories_level2 = cur2.where.not(name:params[:subcategory2])

SELECT "categories".* FROM "categories" WHERE "categories"."parent_id" = ? AND "categories"."name" != ?  [["parent_id", 71], ["name", "Категория2уровня20"]]
SELECT "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Категория2уровня20"], ["LIMIT", 1]]
---
        def show4
            @subcategory1_name = params[:subcategory1]
            @subcategory2_name = params[:subcategory2]
            @subcategory3_name = params[:subcategory3]


            cur1 = Category.where(parent_id:nil)
            @rest_categories_level1 = cur1.where.not(name:params[:subcategory1])

            cur_el_lev2 = Category.find_by(name:params[:subcategory2])

SELECT "materials".* FROM "materials"
---
    def qqq
        @materials = Material.all