app/controllers/frame1_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."parent_id" IS NULL ORDER BY "categories"."name" ASC
---
        def show1
###############


            # arr = Category.where(parent_id: 0..1000)
            # arr2 = []
            # arr.each do |el|
            #     arr2.push(el.id)
            # end


            # name = 'К3а3те3го3рия3'
            # leve = 'уровня'
            # i = 0
            # arr1 = Category.all
            # arr2 = []
            # arr1.each do |el|
            #     arr2.push(el.id)
            # end


            # 150.times do
            #     j = arr2[i]
            #     qqq = name + leve + i.to_s;
            #     Category.create(name:qqq, parent_id:j);
            #     i = i + 1
            # end



            categories = Category.where(parent_id: nil).order(:name)

INSERT INTO "categories" ("name", "parent_id") VALUES (?, ?)  [["name", "Категория3уровня0"], ["parent_id", 152]]
---
            categories.each_with_index do |category, index|
                case index % 3
                when 0
                    @column1.push(category)

SELECT "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Категория1уровня21"], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Категория1уровня16"], ["LIMIT", 1]]
---
        def show2


            active_category1 = Category.find_by(name:params[:subcategory1])
            @active_category1_name = active_category1.name
            @categories_L2 = Category.where("parent_id= #{active_category1.id}")

SELECT "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Категория1уровня21"], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Категория2уровня21"], ["LIMIT", 1]]
---
        def show3
            current_category_L1 = Category.find_by(name:params[:subcategory1])
            @current_category_L1 = current_category_L1.name

            current_category_L2 = Category.find_by(name:params[:subcategory2])